<div>
    <style>
        #blogs{
        padding: 70px 100px 0 100px;
        }

        #blogs .blog-box {
            display: flex;
            align-items: center;
            width: 100%;
            margin-bottom: 70px;
        }

        #blogs .blog-img {
            width: 60%;
            margin-right: 50px;
        }

        #blogs .blog-img img{
            width: 600px;
        }

        #blogs .blog-details {
            width: 50%;
            text-align: justify;
        }

        #blogs .blog-details h4{
            color: #555555;
            text-align: justify;
            font-weight: bold; 
        }

        #blogs .blog-details p{
            color: #555555;
            text-align: justify;
            padding: 0 0 10px 0;
        }

        #blogs .blog-details a{
            text-decoration: none;
            font-size: 13px;
            background-color: #325079;
            color: white;
            padding: 10px;
            border-radius: 6px;
        }

        #blogs .blog-details a:hover {
            background-color: #041e42;
        }
    </style>
    <!-- Competetions -->
    <section id="blogs">
        <div class="blog-box">
            <div class="blog-img">
                <img src="asset/competetions/comp1.jpeg" alt="">
            </div>
            <div class="blog-details">
                <h4>6th RUSC National Science Fiesta 2022</h4>
                <p>রাজশাহী বিশ্ববিদ্যালয় সায়েন্স ক্লাব ৬ষ্ঠ বারের মতো আয়োজন করতে যাচ্ছে ” 6th RUSC National Science Fiesta 2022“
                  জাতীয় বিজ্ঞান ও প্রযুক্তি জাদুঘর এবং রাজশাহী বিশ্ববিদ্যালয় সায়েন্স ক্লাবের যৌথ প্রযোজনায় প্রতিবছরের মতো আয়োজিত হতে যাচ্ছে এবারের সায়েন্স ফিয়েস্টা।আগামী ২৪,২৫ সেপ্টেম্বর, রোজ: শনিবার ও রবিবার রাজশাহী বিশ্ববিদ্যালয়ের টিএসসিসিতে এই সায়েন্স ফিয়েস্টা- ২০২২ অনুষ্ঠিত হবে। প্রত্যেক অংশগ্রহনকারীর জন্য থাকছে “সার্টিফিকেট” এবং আকর্ষণীয় পুরস্কার।কি কি থাকছে ফিয়েস্টাতেঃ</p>
                <a href="#">READ MORE</a>
            </div>
        </div>
        <div class="blog-box">
            <div class="blog-img">
                <img src="asset/competetions/comp2.jpeg" alt="">
            </div>
            <div class="blog-details">
                <h4>Code Samurai 2022</h4>
                <p>Bangladesh Japan Information Technology (BJIT) and the Department of Computer Science and Engineering, University of Dhaka is going to organize a hackathon Code Samurai 2022 .
                  <br>
                  The hackathon will be held with a two-phase competition and the initial selection will be conducted online.</p>
                <a href="#">READ MORE</a>
            </div>
        </div>
        <div class="blog-box">
            <div class="blog-img">
                <img src="asset/competetions/comp3.jpeg" alt="">
            </div>
            <div class="blog-details">
                <h4>শেখ রাসেল অনলাইন কুইজ প্রতিযোগিতা ২০২২</h4>
                <p>নিবন্ধন করুন: https://quiz.sheikhrussel.gov.bd/
                  <br> <br>
                  যারা অংশগ্রহণ করতে পারবে:
                  <br> <br>
                  • গ্রুপ ক: ৮-১২ বছর
                  <br> <br>
                  প্রতিযোগিতার সময়: ৩০ সেপ্টেম্বর ২০২২, সন্ধ্যা ৭টা থেকে ৮টার মধ্যে যেকোনো ১০ মিনিট।
                  <br> <br>
                  • গ্রুপ খ: ১৩-১৮ বছর
                  <br> <br>
                  প্রতিযোগিতার সময়: ০১ অক্টোবর ২০২২, সন্ধ্যা ৭টা থেকে ৮টার মধ্যে যে কোনো ১০ মিনিট।
                  <br> <br>
                  • কুইজের বিষয়:
                  শেখ রাসেলের জন্ম, দুরন্ত শৈশব, শিক্ষা জীবন, স্বপ্ন, ভ্রমণ, পছন্দ, খেলাধুলা, তাঁর উপর রচিত গ্রন্থ, জাতির পিতা বঙ্গবন্ধু শেখ মুজিবুর রহমান ও তাঁর পরিবারের সদস্যদের সঙ্গে কাটানো মুহূর্তসহ বিভিন্ন বিষয় থেকে প্রশ্ন নির্ধারণ করা হবে।
                  <br> <br>
                  📌 নিবন্ধন করা যাবে ২৭ সেপ্টেম্বর, ২০২২, রাত ১২টা পর্যন্ত।</p>
                <a href="#">READ MORE</a>
            </div>
        </div>
        
    </section>
</div>
